{
    "resume": {
        "resumeBullets": [
            {
                "label": " Work_History",
                "logoSrc": "work-history.svg"
            },
            {
                "label": "Internships",
                "logoSrc": "work-history.svg"
            },
            {
                "label": "Education",
                "logoSrc": "education.svg"
            },
            {
                "label": "Projects",
                "logoSrc": "projects.svg"
            },
            {
                "label": "Programming_Skills",
                "logoSrc": "programming-skills.svg"
            }
        ],
        "resumeDetails": {
            "educationDetails": [
                {
                    "heading": "BITS(BIRLA Institute of Technology and Sciences) Pilani",
                    "subHeading": "Master of Technology(M.Tech) in AI & ML",
                    "fromDate": "2023",
                    "toDate": "2025"
                },
                {
                    "heading": "Gyan Ganga Institute of Technology and Sciences",
                    "subHeading": "Bachelors of Engineering in Electronics and Communication, CGPA: 8.46",
                    "fromDate": "2015",
                    "toDate": "2019"
                },
                {
                    "heading": "Advance Cource in Computer Hardware Maintainance",
                    "subHeading": "Studied the computer parts assambling and deassembling, windows command line and BIOS Setup",
                    "fromDate": "2015",
                    "toDate": "2015"
                },
                {
                    "heading": "Small Wonder Senior Secondary School",
                    "subHeading": "Specialization in Physics, Chemistry, Maths and Computer Science, XII: 62%, X: 79.80%.",
                    "fromDate": "2013",
                    "toDate": "2015"
                }
            ],
            "programmingSkillsDetails": [
                {
                    "skills": "JavaScript",
                    "ratingPercentage": 85
                },
                {
                    "skills": "React JS",
                    "ratingPercentage": 85
                },
                {
                    "skills": "React-Native",
                    "ratingPercentage": 85
                },
                {
                    "skills": "Express JS",
                    "ratingPercentage": 89
                },
                {
                    "skills": "NodeJS",
                    "ratingPercentage": 89
                },
                {
                    "skills": "Mongo DB",
                    "ratingPercentage": 70
                },
                {
                    "skills": "Core Java",
                    "ratingPercentage": 80
                },
                {
                    "skills": "HTML",
                    "ratingPercentage": 80
                },
                {
                    "skills": "CSS",
                    "ratingPercentage": 80
                }
            ],
            "projectDetails": [
                {
                    "title": "Personal Portfolio Website",
                    "duration": {
                        "fromDate": 2020,
                        "toDate": 2021
                    },
                    "subHeading": "Technology Used: ReactJS, BootStrap",
                    "description": "A personal portfolio website to showcase all my details and projects at one place."
                },
                {
                    "title": "Home Food Mobile Application",
                    "duration": {
                        "fromDate": 2020,
                        "toDate": 2021
                    },
                    "subHeading": "Technology Used: React-Native, Redux, BootStrap, Google-FireBase",
                    "description": "This application makes users order their daily meal by searching their favorite restaurants near their location by tracking it with the map feature, also the application is secured with a Gmail authorization login screen, moreover, a user is also able to create their profile and all this data is stored and hosted by the google firebase."
                },
                {
                    "title": "Weather Prediction Web-Application",
                    "duration": {
                        "fromDate": 2022,
                        "toDate": 2022
                    },
                    "subHeading": "Technology Used: NodeJS, ExpressJS, HeroKu",
                    "description": "The application helps to predict the accurate weather conditions and temperature"
                }
            ],
            "workHistory": [
                {
                    "heading": "TATA Consultancy Services - Full Time",
                    "subHeading": "IT Analyst",
                    "fromDate": "Nov-2024",
                    "toDate": "Present",
                    "descriptions": [
                        ""
                    ]
                },
                {
                    "heading": "Tech Mahindra Limited - Full Time",
                    "subHeading": "Sr. Software Engineer",
                    "fromDate": "Dec-2022",
                    "toDate": "Oct-2024",
                    "descriptions": [
                        ""
                    ]
                },
                {
                    "heading": "Cognizant Technology Solutions - Full Time",
                    "subHeading": "Jr. Software Engineer",
                    "fromDate": "Nov-2021",
                    "toDate": "Dec-2022",
                    "descriptions": [
                        ""
                    ]
                },
                {
                    "heading": "Jio Platforms Limited - Full Time",
                    "subHeading": "Graduate Engineering Trainee",
                    "fromDate": "July-2019",
                    "toDate": "Oct-2021",
                    "descriptions": [
                        ""
                    ]
                },
                {
                    "heading": "ELTP Jabalpur - Part Time",
                    "subHeading": "Assistant Faculty",
                    "fromDate": "1st",
                    "toDate": "30th, June 2019",
                    "descriptions": [
                        ""
                    ]
                }
            ],
            "internships": [
                {
                    "heading": "BrahMos AeroSpace - Full Time",
                    "subHeading": "Internship Trainee",
                    "fromDate": "1st",
                    "toDate": "28th, July 2019",
                    "descriptions": [
                        "Implementation and usage of AL, ML, VR/AR, Computer Vision in Missile Integration, Missile Guidance System, DOC Seeker, Missile Control System and Missile Engines( RAM JET AND SCRAM JET)."
                    ]
                },
                {
                    "heading": "Bharat Sanchar Nigam Limited - Full Time",
                    "subHeading": "Internship Trainee",
                    "fromDate": "1st",
                    "toDate": "15th, June 2018",
                    "descriptions": [
                        "Concepts of Telecommunication Engineering by studying signal processing and analyzing 2G (GSM), 3G (WCDMA), 3.75 (HSPA+), 4G (LTE & VoLTE), and 5G technologies with the help of MATLAB as a simulation and computation tool, also studied about various physical devices like an antenna with its different types, oscillators, etc."
                    ]
                }
            ],
            "researchDetails": [
                {
                    "heading": "Application of Machine Learning in Intrusion detection using a feedback System: Study",
                    "fromDate": "Year",
                    "toDate": "2021",
                    "subHeading": "Authors: Sagar Shukla, Rajneesh Agrawal",
                    "descriptions": ["Publisher IEEE: 2021 3rd International Conference on Advances in Computing, Communication Control and Networking (ICAC3N)"] 
                },
                {
                    "heading": "Study of Depression Detection using Deep Learning",
                    "fromDate": "Year",
                    "toDate": "2021",
                    "subHeading": "Authors: Hrithik Sanyal, Sagar Shukla, Rajneesh Agrawal",
                    "descriptions": ["Publisher IEEE: 2021 IEEE International Conference on Consumer Electronics (ICCE)"] 
                },
                {
                    "heading": "Natural Language Processing Technique for Generation of SQL Queries Dynamically",
                    "fromDate": "Year",
                    "toDate": "2021",
                    "subHeading": "Authors: Hrithik Sanyal, Sagar Shukla, Rajneesh Agrawal",
                    "descriptions": ["Publisher IEEE: 2021 6th International Conference for Convergence in Technology (I2CT)"] 
                },
                {
                    "heading": "Use of SLAM Technology to Enhance Performance & Accuracy of Bots",
                    "fromDate": "Year",
                    "toDate": "2020",
                    "subHeading": "Authors: Hrithik Sanyal, Sagar Shukla, Rajneesh Agrawal",
                    "descriptions": ["Publisher IEEE: 2020 2nd International Conference on Advances in Computing, Communication Control and Networking (ICACCCN)"] 
                },
                {
                    "heading": "Study of Bot Technology to Provide High Performance and Accuracy using Slam Technology",
                    "fromDate": "Year",
                    "toDate": "2020",
                    "subHeading": "Authors: Sagar Shukla, Rajneesh Agrawal, Hrithik Sanyal",
                    "descriptions": ["Publisher IEEE: 2020 Fourth International Conference on I-SMAC (IoT in Social, Mobile, Analytics and Cloud) (I-SMAC)"] 
                }
            ]
        }
    },
    "aboutMe": {
        "description": "Greetings, I am a passionate Full Stack Developer with a keen interest in research and innovation within the field of computer science. I currently work at Tata Consultancy Services (TCS), where I contribute to end-to-end software development solutions across various domains. In addition to my core development expertise, I have developed a growing proficiency in Generative AI, Artificial Intelligence (AI), and Machine Learning (ML). My primary tech stack includes Node.js and JavaScript, while for competitive programming, I prefer Java for its performance and reliability. Over the course of my career, I’ve worked with a diverse set of tools and platforms including Kubernetes, Kibana, Postman, Kafka, and Sequelize, enabling me to build scalable, efficient, and robust applications. A strong foundation in data structures and algorithms has helped me significantly optimize backend APIs and improve system performance. I am continuously driven by a curiosity to learn and explore emerging technologies, always seeking new challenges and opportunities to grow in the field of software engineering and AI..",
        "highlights": {
            "bullets": [
                "Full Stack Web and Mobile Development",
                "Interactive Front end as per the design",
                "React and React Native",
                "Redux for state Management",
                "Building Rest API's",
                "Managing DataBase"
            ],
            "heading": "Here are a few Highlights:"
        }
    },
    "profile": {
        "profileRoleTagLine": "Software Enginner | NodeJS | ReactJS | Docker | Kubernetes | AI/ML"
    },
    "testimonial": {
        "peopleDetails": [
            {
                "name": "Gaurav Sukhatme",
                "designation": "Software consulting Engineer - Cisco | DevNet Associate",
                "recommendationGiven": "It’s rare that you come across standout talent like Sagar. I've known him since middle school. I’m amazed by his ability to make friends with anyone, a skill he uses to full effect when presenting proposals. Sagar would be an asset to any company.",
                "imagelocation": "../../assets/Testimonial/GauravSmall.png",
                "serialNumber": 0
            },
            {
                "name": "Mugunthan Gunasekaran",
                "designation": "Service Delivery Manager | Cognizant",
                "recommendationGiven": "Sagar has been exceptional in his work so far. He was never hesitant to face challenges. The journey so far has not been easy but still, Sagar stood up every single time and went beyond his call of duty. His dedication commitment and never settling attitude have saved the project from being escalated, not just once but almost every week. Sagar is definitely an asset to the team!",
                "imagelocation": "../../assets/Testimonial/MugunthanPic.jpeg",
                "serialNumber": 1
            },
            {
                "name": "Padmashree Subramanian",
                "designation": "Manager - Projects | Cognizant",
                "recommendationGiven": "Sagar, your recent work on Jenkins issue resolution has been commendable. The way you exhibited your focus and perseverance is very impressive and will take you to great heights. Your calmness throughout the battle under great pressure is an asset. Happy and proud to have you with us!! Keep up all the good work!",
                "award": "Always striving, never settling - 26th April 2022",
                "imagelocation": "../../assets/Testimonial/padmaImage.jpeg",
                "serialNumber": 2
            },
            {
                "name": "Padmashree Subramanian",
                "designation": "Manager - Projects | Cognizant",
                "recommendationGiven": "Thank you, Sagar - Sagar, if you think nobody noticed all your hard work and the enormous amount of effort that you put in to cross the hurdles, you are wrong! Your unswerving commitment and focus are an asset and will take you to great heights. Thank you so much for all your good work - Much appreciated Keep up the good work.",
                "award": "Always striving, never settling - 23rd May 2022",
                "imagelocation": "../../assets/Testimonial/padmaImage.jpeg",
                "serialNumber": 2
            },
            {
                "name": "Padmashree Subramanian",
                "designation": "Manager - Projects | Cognizant",
                "recommendationGiven": "THE MOUNTAIN MOVER - Sagar, your support on the ground to solve all the issues is highly commendable. You have never left any stones unturned, and your attitude to work as a team and keep cool amidst all the pressure is something I would like to learn from you! Best wishes - Keep up the good work",
                "award": "Working as one - 30th May 2022",
                "imagelocation": "../../assets/Testimonial/padmaImage.jpeg",
                "serialNumber": 2
            }
        ]
    },
    "researchList":{
        "researchDetails": [
            {
                "title": "Study of Depression Detection using Deep Learning",
                "description": "Deep learning is becoming an important method of machine learning and has proven to provide its strength in data sciences and artificial intelligence. It works with unstructured and unlabeled data. Deep learning is more accurate than conventional classifier-based machine learning. The reason for high accuracy is managing by a count of hidden layers, application of activation functions, weighted activation functions, etc. In this work, a new weighted activation function is being proposed to get high accuracy for deep learning. The weighted activation function is going to be applied and tested on a depression dataset to evaluate the intensity of depression.",
                "tags": ["Machine Learning", "Deep Learning", "Activation Functions", "Artificial Intelligence"],
                "link": "https://ieeexplore.ieee.org/document/9427624/keywords#keywords"
              },
              {
                "title": "Application of Machine Learning in Intrusion detection using a feedback System: Study",
                "description": "With the growth and expansion of network technologies, every corner of the world is now connected and people are using the Internet to a great extent. As an eternal truth, every growth brings many challenges along with it. Some challenges over the Internet are security, availability, speed, congestion, etc. Among all major threats, security is most important and must be dealt with a lot of attention and accuracy. Security measures applied must work on time (real-time) and must not cause a lot of delays in the processing of data. For security over the Internet, Intrusion Detection techniques are being used prominently. Intrusion Detection Systems (IDS) process every incoming and outgoing data packet from the system whether a particular machine or a network. Hence it requires working with huge of data that not only contains the information linked to security threats but can also learn from them and apply it for all future traffic. This work provides an IDS with machine learning to process large data of IP packets.",
                "tags": ["Classification", "Artificial Intelligence", "Security", "Machine Learning", "Authorization", "Machine Learning Classifier Techniques"],
                "link": "https://ieeexplore.ieee.org/document/9725764/keywords#keywords"
              },{
                "title": "Use of SLAM Technology to Enhance Performance & Accuracy of Bots",
                "description": "Bot technology is proving to be a boon in the current era when Internet has become a necessity for the world. With the advantage that it collects remote data with authentication and authorization using the various automation features, it has added not only to collect data but also to provide it to the desiring users with lot of ease. As now a days the data usage and storage is increasing continuously there is a need for a more accurate and appropriate method which can provide customized and relevant data with respect to the specific need, current algorithms used by search engines google, yahoo and Bing is providing the data in an un-customized manner and it is also very time consuming , due to which the user get lost in the huge data and has to deal with time latency as well. To overcome this, we have proposed a general solution in this paper which can provide better filtering of data specific to the information needed, reduce time latency by using various technologies and algorithms with better accuracy.",
                "tags": ["Artificial Intelligence", "Machine Learning", "Authorization", "Role-Based Access Control", "Decision Tree Algorithm", "Security", "Classification"],
                "link": "https://ieeexplore.ieee.org/document/9362944/keywords#keywords"
              },
              {
                "title": "Study of Bot Technology to Provide High Performance and Accuracy using Slam Technology",
                "description": "As the resources over the internet are increasing day by day in terms of both hardware and software, information stored over them is also increasing exponentially. Related information stored over the Internet is not only increasing but it is widespread around the world on different resources. Search engines e.g. Google, Bing, Yahoo etc. are listing this information to the users based on their own designed algorithms which require ways to associate information providers to these search engines services. This mechanism has two major drawbacks, first, it bounds to the information providers to provide permissions forcefully to the search engine service provider and second is they are generalized and users get lost in huge information retrieved by the search services. Along with this, the information retrieval is time-consuming as well. This work is focusing to provide high performance, high accuracy, customization-based search tool which leverages the advantages of multiple technologies.",
                "tags": ["Machine Learning", "Artificial Intelligence", "Security" , "Authorization" , "Role-Based Access Control", "Classification", "Decision Tree Algorithm"],
                "link": "https://ieeexplore.ieee.org/document/9243541/keywords#keywords"
              },
              {
                "title": "Natural Language Processing Technique for Generation of SQL Queries Dynamically",
                "description": "Natural Language Processing is being used in every field of human to machine interaction. Database queries although have a confined set of instructions, but still found to be complex and dedicated human resources are required to write, test, optimize and execute structured query language statements. This makes it difficult, time-consuming and many a time inaccurate too. Such difficulties can be overcome if the queries are formed dynamically with standard procedures. In this work, parsing, lexical analysis, synonym detection and formation processes of the natural language processing are being proposed to be used for dynamically generating SQL queries and optimization of them for fast processing with high accuracy. NLP parsing of the user inputted text for retrieving, creation and insertion of data are being proposed to be created dynamically from English text inputs. This will help users of the system to generate reports from the data as per the requirement without the complexities of SQL. The proposed system will not only generate queries dynamically but will also provide high accuracy and performance.",
                "tags": ["Natural Language Processing", "Parsing", "Lexical Analysis", "Structured Query Language", "English Text"],
                "link": "https://ieeexplore.ieee.org/document/9418091/keywords#keywords"
              }
            ]
        }
}